# программа для кодирования текстового сообщения в соответствии с кодом Морзе

letters = [c for c in 'ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789']
morse = ['.-', '-...', '-.-.', '-..', '.', '..-.', '--.', '....', '..', '.---', '-.-', '.-..', '--', '-.', '---',
         '.--.', '--.-', '.-.', '...', '-', '..-', '...-', '.--', '-..-', '-.--', '--..', '-----', '.----', '..---',
         '...--', '....-', '.....', '-....', '--...', '---..', '----.']
code = dict(zip(letters, morse))
phrase = [_.upper() for _ in input()]

for sign in phrase:
    if sign in code:
        print(code[sign], end=" ")

